["Уровень 1 - Абитуриент", [["lg(2-х) = 2lg4 - lg2", ["-6", "6", "8", "2"], 0], ["Найдите значение выражения log 4 (64c), если log 4 c = - 3,5.", ["-6,5", "-0,5", "-10,5", "-67,5"], 1], ["Брошены две игральные кости. Какова вероятность того, что на обеих костях появятся по 2 очка? Ответ округлите до сотых.", ["0,4", "0,2", "0.5", "0,28"], 3], ["Найдите наибольшее значение функции у = -5 log 1/3 x на отрезке [1/3; 3].", ["1/3", "-5", "5", "5/3"], 2], ["5 3,5+х >1/125", ["(0,5; +∞)", "(-∞; -6,5)", "(-∞; 7)", "(-6,5; +∞)"], 3], ["Найдите значение выражения:  6 · 4,5 log 4,5 9.", ["6", "27", "12", "54"], 3], ["Найдите значение выражения log3 (9а), если log3 а = 0,3.", ["0,6", "2,3", "2,7", "9,3"], 1], ["Во сколько раз увеличится боковая поверхность правильной треугольной пирамиды, если ее стороны основания увеличить в 2 раза, а апофему – в 3 раза?", ["6", "4", "3", "8"], 0], ["Равносторонний треугольник вращается вокруг своей стороны, которая равна 4. Найдите отношение V/pi, где V – объем тела вращения.", ["16", "4", "64", "8"], 0], ["В классе 20 человек. Сколькими способами можно выбрать из класса команду из 3 человек для участия в олимпиаде по математике, истории, литературе?", ["684", "360", "6840", "380"], 2], ["Найдите диагональ осевого сечения цилиндра, если радиус цилиндра равен 1,5 дм, а высота – 4 дм.", ["25", "5", "18,25", "12,5"], 1], ["Кто из великих математиков завещал построить над своей могилой памятник в виде шара и цилиндра в память о том, что он нашёл отношение объёмов цилиндра и вписанного в него шара – 3:2?", ["Пифагор", "Демокрит", "Евклид", "Архимед"], 3], ["Отношение длины окружности к диаметру постоянно, не зависит от радиуса круга. Эта постоянная величина имеет два неофициальных праздника. Как называется это число?", ["Рациональное", "Целое", "е", "Пи"], 3], ["Французский математик, астроном. Один из создателей теории вероятности. Громадные заслуги в области прикладной математики. Известен работами в области небесной механики.", ["Кеплер", "Лаплас", "Гаусс", "Эйлер"], 1], ["Тысяча тысяч – это миллион. Тысяча миллионов – это биллион или миллиард. Тысяча миллиардов, т.е. 1 000 000 000 000 – триллион, дальше 1000 000 000 000 000 – квадриллион, квинтиллион, секстиллион, септиллион, октиллион, нониллион, дециллион. Все числа пересчитать невозможно. Физики подсчитали, что количество атомов – мельчайших частиц вещества – во всей Вселенной не превосходит некоторого числа, выражаемого единицей со ста нулями. Какое название получило это число?", ["Бесконечность", "Астрономическое число", "Гугол", "Тьма"], 2], ["Какие числа на Руси называли ломаными?", ["Дроби", "Иррациональное", "Натуральное", "Целые"], 0], ["Когда торговцам и ремесленникам чисел было уже достаточно, математики Древней Греции, ученики Пифагора, обнаружили, что есть числа, которые не выражаются никакой дробью. Первым таким числом стала длина диагонали квадрата. Как называют такое число?", ["Неизвлекаемое", "Арифметический корень", "Иррациональное", "Периодическое"], 2], ["Понятия «тангенс» и «котангенс», как и первые таблицы этих величин, появились не из рассмотрения тригонометрической окружности, а из учения о солнечных часах. Также в связи с солнечными часами появилось и понятие «косеканс». Кто впервые ввел понятие «косеканс»?", ["Насир ад-Дина", "Хабаш ал-Хасиб", "Ал- Баттани", "Абу-л-Вафа"], 1], ["К зачету по математике из 20 вопросов ученик знал ответы на 15 вопросов. Какова верояность того, что ему достанется вопрос, на который он не знал ответа?", ["0,25", "0,75", "0,05", "0,5"], 0], ["Искусству присуще стремление к стройности, соразмерности, гармонии. Мы находим их в пропорциях архитектуры и скульптуры, в расположении предметов и фигур, сочетании красок в живописи. Одна из пропорций, наиболее чаще всех встречающаяся в искусстве, получила название \"золотое сечение\". Кто впервые ввёл этот термин?", ["Микеланджело", "Леонардо да Винчи", "Лука Пачоли", "Рафаэль Санти"], 1]], "Уровень 2 - Студент первого курса", [["Уравнение скорости для тела массой 20 кг имеет вид υ = 1+3t. Чему равен импульс тела через 5 с после начала наблюдения?", ["320 кг м.с", "36 кг м.с", "16 кг м.с", "20 кг м.с"], 0], ["В металлической сфере диаметром 20 см находится 7 г воздуха. До какой температуры можно нагреть сферу, если давление, которое она выдерживает, составляет 0,3·106 Па?", ["326 K", "426 K", "526 K", "626 K"], 3], ["Два одинаковых точечных заряда находятся на расстоянии R друг от друга. Если расстояние уменьшить на 50 см, то сила взаимодействия увеличится в 2 раза. Рассчитайте чему равно расстояние R?", ["1,4 м", "40 см", "140 м", "5 м"], 0], ["Над центром круглого стола радиусом 1 м на высоте 2 м подвешена лампа силой света 200 кд. Рассчитайте освещенность стола на его краях.", ["400 лк", "35,8 лк", "45 лк", "100 лк"], 1], ["Небольшое тело на нити совершает свободные колебания как математический маятник. В каких точках траектории движения тела его скорость максимальна?", ["Ни в одной из точек", "В двух крайних точках и в положении равновесия", "Только в положении равновесия", "Только в левой и правой крайних точках"], 2], ["Доказано, что свет обладает давлением. Можно ли тоже самое сказать про инфракрасное излучение?", ["Да", "Нет", "Зависит от мощности излучения", "Зависит от времени излучения"], 0], ["Яблоко массой 200 г упало с высоты 3 м. Кинетическая энергия яблока в момент касания поверхности Земли приблизительно равна ...", ["600 Дж", "0,6 Дж", "6 Дж", "203 Дж"], 2], ["Тело вращается с угловой скоростью 5 рад/с по окружности радиусом 5 м. Чему равна линейная скорость вращения?", ["25 м/с", "1 м/с", "5 м/с", "10 м/с"], 0], ["Плотность воды 1000 кг/м3. Определите релятивистскую плотность воды для неподвижного наблюдателя, если сосуд с водой движется со скоростью 0,8 с.", ["1000 кг/м³", "800 кг/м³", "2780 кг/м³", "2400 кг/м³"], 2], ["Он изучал природу тепла и обнаружил ее связь с механической работой. Это привело его к идее сохранения энергии, что, в свою очередь, позволило сформулировать первый закон термодинамики. Он работал с лордом Кельвином над абсолютной шкалой температуры. Воспитывался в семье богатого пивовара, работал на заводе. О ком идет речь?", ["Джеймс Джоуль", "Джон Дальтон", "Джозеф Блэк", "Роберт Бойль"], 0], ["Почему растения поливают либо вечером, либо рано утром?", ["Чтобы листья не получили ожог", "Чтобы вода не нагревалась", "Чтобы вода впитывалась лучше", "Человек плохо переносит жару во время физической нагрузки"], 0], ["Как называется мысленный эксперимент, в котором cточки зрения «неподвижных» наблюдателей все процессы у двигающихся объектовзамедляются, согласно СТО. С другой стороны,принцип относительностидекларирует равноправиеинерциальных систем отсчёта, и при помощи которого пытаются «доказать» противоречивость специальной теории относительности.", ["Парадокс близнецов", "Парадокс кванта", "Парадокс Керролла", "Парадокс маляра"], 0], ["На рубеже XIX-XX веков врачи разных стран проводят на себе эксперименты с электричеством. Опыты проводятся в самых разнообразных условиях: с влажными руками, стоя без обуви на полу, с сухими руками, в сухих сапогах и т.д. Какова была цель этих опытов?", ["Разработать нормы безопасности при работе с электрическим оборудованием", "Доказать возможность человеческого тела проводить электрический ток", "Доказать способность человеческого тела притягивать железные опилки", "Наблюдать искру при прохождении электрического тока"], 0], ["Фактически предпосылки к появлению квантового генератора электромагнитного излучения оптического диапазонапоявились еще в начале 20-ого столетия. Какое название носит этот прибор?", ["Лазер", "Конденсатор", "Камера Вильсона", "Дозиметр"], 0], ["Изменится ли скорость вытекания молока из негерметичного пакета при его падении?", ["Нет, не измениться", "Скорость выьекания увеличиться", "Скорость вытекания уменьшится", "Молоко перестанет вытекать из пакета"], 3], ["О нем великий Максвелл сказал: «Исследования, в которых он установил законы механического взаимодействия электрических токов, принадлежат к числу самых блестящих работ, которые проведены когда-либо в науке. Теория и опыт как будто в полной силе и законченности вылились сразу из головы этого «Ньютона электричества». Он стал академиком за исследования в области математики и химии. На его надгробном памятнике высечены слова: «Он был так же добр и прост, как и велик». О каком ученом идет речь?", ["Анри Амлер", "Георг Ом", "Шарль Кулон", "Джеймс Уатт"], 0], ["Этот ученый оглох в десятилетнем возрасте, не смог учиться в школе и вынужден был заниматься самостоятельно. В 16 лет он увлекался атрономией, физикой, механикой и изобретательством. В дальнейшем он стал школьным учителем. Кто этот знаменитый ученый?", ["Циолковский", "Кеплер", "Ландау", "Юнг"], 0], ["Альберт Эйнштейн – один из величайших ученых мира, основатель современной теоретической физики, лауреат Нобелевской премии по физике 1921 года. Талантливые люди талантливы во всем. А на каком инструменте играл Альберт Эйнштейн с юных лет?", ["Гитара", "Пианино", "Саксофон", "Скрипка"], 3], ["Шведский химик Альфред Нобель (1833-1896) смешал нитроглицерин с кизельгуром и получил устойчивую смесь. Он продавал эту смесь в трубках из пропитанного воском картона. О чем идет речь?", ["Лекарство", "Зажигалка", "Мороженое", "Динамит"], 3], ["Как изменится энергия магнитного поля, созданного рамкой по которой протекает электрический ток, при увеличении силы тока в 2 раза?", ["Не изменится", "Увеличится ы 2 раза", "Увеличится в 4 раза", "Уменьшится в 2 раза"], 2]], "Уровень 3 - Студент второго курса", [["Сколько нулей в двоичной записи числа 513?", ["1", "2", "8", "9"], 2], ["При включении компьютера процессор обращается к ...", ["ОЗУ", "Винчестеру", "ПЗУ", "Дискете"], 2], ["Детская игрушка воспроизводит назойливый повторяющийся звуковой фрагмент длительностью 8 секунд с частотой дискретизации звука 16 кГц, глубиной кодирования звука 8 бит, в режиме моно. Определить, ПЗУ с какой маркировкой использовал скупой производитель для выпуска этого средства психологического давления на родителей.", ["64 КБ", "128 КБ", "256 КБ", "512 КБ"], 1], ["Сложите числа и результат запишите в двоичной системе счисления: 4810 + АF16 + 558", ["100001100", "110000100", "110001100", "110011000"], 0], ["Запись числа 6810 в системе счисления с основанием N оканчивается на 2 и содержит 4 цифры. Чему равно основание этой системы счисления N?", ["2", "3", "4", "6"], 1], ["Скорость передачи данных через ADSL-соединение равна 256000 бит/с. Передача файла через данное соединение заняла 16 секунд. Определите размер файла в КБайтах.", ["400", "500", "600", "625"], 1], ["В интернет-магазине предлагается набор звуковых эффектов для озвучивания видеофильмов к школьному выпускному балу. В качестве носителя предложен DVD-диск (4,4 ГБ). Заявлена частота дискретизации звука 44 кГц, глубина кодирования звука 16 бит, режим – стерео (две звуковых дорожки). Длительность каждого эффекта 10 секунд. Утверждается, что диск записан полностью. О каком количестве файлов идет речь? Вычислите максимально возможный вариант.", ["Не менее 1000", "Не менее 2000", "Не менее 4000", "Не менее 8000"], 1], ["Полная фортепианная клавиатура охватывает семь с четвертью октав, таким образом, количество белых и черных клавиш, на которых играют пианисты, равно 88. Какого минимального количества информации достаточно, чтобы закодировать в двоичный код каждую клавишу?", ["7 бит", "6 бит", "8 бит", "88 бит"], 1], ["Основным элементом электронных таблиц является ...", ["Строка", "Столбец", "Ячейка", "Таблица"], 2], ["Только в русском языке и некоторых языках бывших советских республик знак @ называют собачкой. А как же этот знак называют в других странах чаще всего?", ["Обезьянкой", "Сельд под маринадом", "Лунное ухо", "Улиткой под шубой"], 0], ["Этот тип памяти – энергозависимый и позволяет записывать и хранить данные в микросхемах. А также не имеют в своем составе движущихся частей, что обеспечивает высокую сохранность данных. О чем идет речь?", ["CD, DVD диски", "Flash карты", "Съемные жесткие диски", "Blue Ray диски"], 1], ["В доме 16 этажей. На каждом этаже по несколько квартир. Сообщение о том, что Саша живет в квартире №40, содержит 6 бит информации. Сколько квартир на этаже?", ["6", "4", "8", "3"], 1], ["Объем сообщения, содержащего 4096 символов, равен 1/512 части Мбайта. Какова мощность алфавита, с помощью которого записано это сообщение?", ["16384", "16", "8", "40968"], 1], ["Для передачи сигналов на флоте используются специальные сигнальные флаги, вывешиваемые в одну линию (последовательность важна). Какое количество различных сигналов может передать корабль при помощи трех сигнальных флагов, если на корабле имеются флаги трех различных видов (флагов каждого вида неограниченное количество)?", ["8", "9", "27", "81"], 2], ["Модем, передающий информацию со скоростью 28 800 бит/с, может передать несколько страниц текста (размером 5400 байт) в течение ...", ["1 c", "1,5 c", "2 c", "2,5 c"], 1], ["В табличном процессоре Microsoft Excel выделена группа ячеек D2:E3. Сколько ячеек входит в эту группу?", ["4", "5", "3", "2"], 0], ["Десятичное число 5,65 перевели в четвертичную систему счисления. Найти 2012-ю цифру после запятой.", ["2", "3", "4", "5"], 0], ["Если в ячейке электронной таблицы MS Excel отображается последовательность символов ######, то это означает, что ...", ["Формула записана с ошибкой", "В формуле есть циклическая ссылка", "Столбец недостаточно широк для размещения информации", "Произошла ошибка в вычислении"], 2], ["Как назывался первый советский серийный универсальный 8-разрядный персональный компьютер, ориентированный для применения в сфере народного образования?", ["Микроша", "БК", "Корвет", "Агат"], 3], ["Какие комплектующие для шаттлов НАСА в 2002 году покупало через eBay?", ["Процессор", "Винчестер", "Оперативная память", "Материнская плата"], 0]], "Уровень 4 - Студент третьего курса", [["Браузеры (например, Internet Explorer) являются...", ["Серверами Интернета", "Почтовыми программами", "Средством создания Web-страниц", "Средством просмотра Web-страниц"], 3], ["Заданы имя почтового сервера (alfa-centavra), находящегося в России, и имя почтового ящика (Alex). Определить электронный адрес.", ["alfa-centavra@Alex.Russia", "alfa-centavra.Alex@ru", "Alex.alfa-centavra@ru", "Alex@alfa-centavra.ru"], 3], ["Адресом электронной почты в сети Интернет может быть...", ["victor@", "nT@@mgpu.nisk.ni", "2:5020/23.77", "xizOI23@DDOHRZ21.uk"], 3], ["Rambler.ru является...", ["Web-сайтом", "Браузером", "Программой, обеспечивающей доступ в Интернет", "Поисковым сервером"], 3], ["Организация, обеспечивающая доступ к информационным ресурсам Интернета – это...", ["Провайдер", "Браузер", "Web-узел", "Web-сервер"], 0], ["Протокол – это...", ["Список абонентов компьютерной сети", "Программа, приводящая полученное сообщение к стандартной форме", "Соглашение о единой форме представления и способа пересылки сообщений", "Список обнаруженных ошибок в передаче сообщений"], 2], ["Модем – это ..., согласующее работу ... и телефонной сети. Вместо многоточий вставить соответствующие слова:", ["устройство, программа", "устройство, дисковода", "устройство, компьютера", "программа, компьютера"], 2], ["Чтобы соединить два компьютера по телефонным линиям, необходимо иметь:", ["Модем на одном из компьютеров", "Модем и специальное программное обеспечение на одном из компьютеров", "По модему на каждом компьютере", "По модему на каждом компьютере и специальное программное обеспечение"], 3], ["Для просмотра World Wide Web требуется...", ["Знание IP-адресов", "Текстовый редактор", "URL (универсальный указатель ресурсов", "Специальная программа с графическим интерфейсом – браузер"], 3], ["Какая из служб сети Интернет позволяет взаимодействовать с удаленным пользователем в реальном времени?", ["Форум", "Чат", "Электронная доска", "Гостевая книга"], 1], ["Какой из способов подключения к Интернет обеспечивает наибольшие возможности для доступа к информационным ресурсам?", ["Постоянное соединение по оптоволоконному каналу", "Удаленный доступ по коммутируемому телефонному каналу", "Постоянное соединение по выделенному телефонному каналу", "Терминальное соединение по коммутируемому телефонному каналу"], 0], ["Модем, передающий информацию со скоростью 28 800 бит/с, может передать две страницы текста (3 600 байт) в течение...", ["1 минуты", "1 часа", "1 секунды", "1 дня"], 2], ["Электронная почта (e-mail) позволяет передавать...", ["Только сообщения", "Только файлы", "Сообщения и приложенные файлы", "Видеоизображения"], 1], ["Какой протокол является базовым в Интернет?", ["HTTP", "HTML", "TCP", "TCP/IP"], 3], ["Компьютер, подключенный к Интернет, обязательно имеет...", ["IP-адрес", "Web-сервер", "Домашнюю web-страницу", "Доменное имя"], 0], ["Гиперссылки на web - странице могут обеспечить переход...", ["Только в пределах данной web - страницы", "Только на web - страницы данного сервера", "На любую web - страницу данного региона", "На любую web - страницу любого сервера Интернет"], 3], ["Задан адрес электронной почты в сети Internet: user_name@int.glasnet.ru. Каково имя владельца электронного адреса?", ["int.glasnet.ru", "user_name", "glasnet.ru", "ru"], 1], ["Web-страницы имеют формат (расширение)...", ["*.txt", "*.htm", "*.doc", "*.exe"], 1], ["Количество пользователей Интернет во всем мире составляет примерно ...", ["1 млн.", "10 млн.", "50 млн.", "200 млн."], 3], ["Скорость передачи информации по магистральной оптоволоконной линии обычно составляет не меньше, чем ...", ["28,8 бит/с", "56,6 Кбит/с", "100 Кбит/с", "1 Мбит/с"], 3]], "Уровень 5 - Студент четвертого курса", [["Названием стандартной функции вычисления х*х ...", ["Ln", "Round", "Sqrt", "Sqr"], 3], ["Подходом к программированию, основанному на теории структурно-модульного построения является...", ["Процедурный подход", "Объектно-ориентированный подход", "Операциональный подход", "Рекурсивный  подход"], 0], ["Какая связка операторов является циклом с предусловием?", ["For ... to ... do", "For ... downto ... do", "Repeat ... until", "While ... do"], 3], ["Укажите неверное утверждение ...", ["Процедура в Паскале не должна возвращать значение процедуры", "Параметр переменная описывается после указания Var", "Параметр значение нельзя изменять внутри подпрограммы", "Глобальная переменная действует только внутри подпрограммы"], 3], ["Какая из функций преобразует значение из Edit в Integer?", ["strtoint", "inttostr", "strtofloat", "floattostr"], 0], ["Какое из свойств StringGrid определяет толщину линий таблицы?", ["ColCount", "FixedRows", "GridLineWidth", "DefaultColWidth"], 2], ["Какая из конструкций языка Паскаль не относится к циклам?", ["repeat", "while", "for", "case"], 3], ["Для сохранения текста в файле применяется метод компонента Memo ...", ["Add", "LoadFromFile", "Execute", "SaveToFile"], 3], ["Какая связка операторов является проверкой условия?", ["For ... to ... do", "If ... then ... else", "Repeat ... until", "While ... do"], 1], ["Какая из конструкций обозначает поиск подстроки?", ["TStringList", "Mod", "Copy", "Pos"], 3], ["Какому из операторов в блок-схеме алгоритма соответствует шестиугольник?", ["if ... then", "For N:=1 to 10 do", "N:=N+1", "else"], 1], ["Названием окна, где отображается текст программы Delphi является...", ["Object Inspector", "Project Manager", "Structure", "Code"], 3], ["Какая из функций преобразует значение из Edit в Real?", ["strtoint", "inttostr", "strtofloat", "floattostr"], 2], ["Какое из выражений дается в блок-схеме алгоритма внутри прямоугольника?", ["А>2", "begin", "N=N+1", "1"], 2], ["Какая из пары типов данных относится только к целым числам?", ["Integer и Real", "Boolean и Real", "Word и Byte", "Single и Double"], 2], ["Какое из обозначений является не стандартной функцией, а является методом класса?", ["add(S)", "odd(x)", "copy(S,N,M)", "pos(S,S1)"], 0], ["Какой из компонентов Delphi является списком строк?", ["StringGrid", "Memo", "UpDown", "SaveDialog"], 1], ["Какой из  перечисленных подходов к программированию включен во все современные языки программирования?", ["Процедурный подход", "Объектно-ориентированный подход", "Операциональный подход", "Рекурсивный  подход"], 3], ["Какой из компонентов Delphi имеет свойство FileName?", ["StringGrid", "Memo", "UpDown", "SaveDialog"], 1], ["Укажите неверное утверждение...", ["Явная итерационная формула имеет вид x=f(x)", "Соотношение Горнера: Р(n+1) = P(n)+x*a(n)", "Косвенная оценка погрешности равна: | x(k+1)  - x(k) |", "Рекурсия с действием на спуске, если действие выполняется до вызова рекурсии"], 1]]]